//------------------------------------------------------------------------------------------------------------
#include "Config.hpp"  // Подключаем наш же заголовок
//------------------------------------------------------------------------------------------------------------
namespace AsConfig
{
const std::string_view ProjectName = "Learning C++ on Linux";
const int ProjectVersionMajor = 1;
const int ProjectVersionMinor = 0;

}  // namespace AsConfig
//------------------------------------------------------------------------------------------------------------
